yii2/backend/controllers/WcCoachController.php

SELECT * FROM `wc_coach` WHERE coachname = '切尔切索夫'
---
    public function actionTeam($name,$tname)
    {
        $qry = new query();
        $qry->select('*')
            ->from('wc_coach')
            ->where('coachname = \'' . $name . '\'');
        $id = $qry->one()['coachid'];

SELECT * FROM `wc_coach` WHERE `coachid`='1'
---
    protected function findModel($id)
    {
        if (($model = WcCoach::findOne($id)) !== null) {