yii2/backend/controllers/WcMomentController.php

    public function actionCreate()
    {
        $model = new WcMoment();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `wc_moment` (`describes`, `url`) VALUES ('2018世界杯射手榜', 'http://2018.sina.com.cn/scorer/page.shtml')

    protected function findModel($id)
    {
        if (($model = WcMoment::findOne($id)) !== null) {
---
SELECT * FROM `wc_moment` WHERE `momentid`='1'