yii2/backend/controllers/WcPlayerController.php

SELECT * FROM `wc_player` WHERE `pid`='1'
---
    protected function findModel($id)
    {
        if (($model = WcPlayer::findOne($id)) !== null) {