yii2/backend/controllers/WcTeamController.php

SELECT * FROM `wc_team` WHERE tname = '沙特阿拉伯'
---
    public function actionMatch($tname)
    {
        $qry = new query();
        $qry->select('*')
            ->from('wc_team')
            ->where('tname = \'' . $tname . '\'');
        $id = $qry->all()[0]['tid'];

SELECT * FROM `wc_team` WHERE `tid`='5'
---
    protected function findModel($id)
    {
        if (($model = WcTeam::findOne($id)) !== null) {